The full common plan

```
Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.notify_slack_critical_us_east_1.module.lambda.local_file.archive_plan[0] has been deleted
  - resource "local_file" "archive_plan" {
      - content              = jsonencode(
            {
              - artifacts_dir = "builds"
              - build_plan    = [
                  - [
                      - "zip",
                      - ".terraform/modules/notify_slack_critical_us_east_1/functions/notify_slack.py",
                      - null,
                    ],
                ]
              - filename      = "builds/9540d85f74c4113867007d3a68ed87855cccd09234105e7492327a0d7572b16c.zip"
              - runtime       = "python3.8"
            }
        ) -> null
      - directory_permission = "0755" -> null
      - file_permission      = "0644" -> null
      - filename             = "builds/9540d85f74c4113867007d3a68ed87855cccd09234105e7492327a0d7572b16c.plan.json" -> null
      - id                   = "a8b4568fe200c98dc284167a627459387[388](https://github.com/cds-snc/notification-terraform/actions/runs/3933684912/jobs/6727654258#step:6:389)cf24" -> null
    }

  # module.notify_slack_ok_us_east_1.module.lambda.local_file.archive_plan[0] has been deleted
  - resource "local_file" "archive_plan" {
      - content              = jsonencode(
            {
              - artifacts_dir = "builds"
              - build_plan    = [
                  - [
                      - "zip",
                      - ".terraform/modules/notify_slack_ok_us_east_1/functions/notify_slack.py",
                      - null,
                    ],
                ]
              - filename      = "builds/f6e8800f6dab7a4c6d263ade99eb7d36027d8726cd7a5c49e0f7f812485eda7d.zip"
              - runtime       = "python3.8"
            }
        ) -> null
      - directory_permission = "0755" -> null
      - file_permission      = "0644" -> null
      - filename             = "builds/f6e8800f6dab7a4c6d263ade99eb7d36027d8726cd7a5c49e0f7f812485eda7d.plan.json" -> null
      - id                   = "b2eaba3fb694c6fb2d5ce3932bae4c83828dfe22" -> null
    }

  # module.notify_slack_warning_us_east_1.module.lambda.local_file.archive_plan[0] has been deleted
  - resource "local_file" "archive_plan" {
      - content              = jsonencode(
            {
              - artifacts_dir = "builds"
              - build_plan    = [
                  - [
                      - "zip",
                      - ".terraform/modules/notify_slack_warning_us_east_1/functions/notify_slack.py",
                      - null,
                    ],
                ]
              - filename      = "builds/360cdc7ecfe3d77e32ea1a5ba2459ed54a566fa47c4f658c0eddfa3365c79c47.zip"
              - runtime       = "python3.8"
            }
        ) -> null
      - directory_permission = "0755" -> null
      - file_permission      = "0644" -> null
      - filename             = "builds/360cdc7ecfe3d77e32ea1a5ba2459ed54a566fa47c4f658c0eddfa3365c79c47.plan.json" -> null
      - id                   = "afe5c4c120e6f2b97d9645a2d4952138ac5f08fd" -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_permission.sns_critical_us_east_1_to_slack_lambda will be created
  + resource "aws_lambda_permission" "sns_critical_us_east_1_to_slack_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "arn:aws:lambda:ca-central-1:2[390](https://github.com/cds-snc/notification-terraform/actions/runs/3933684912/jobs/6727654258#step:6:391)4[391](https://github.com/cds-snc/notification-terraform/actions/runs/3933684912/jobs/6727654258#step:6:392)1459:function:notify-slack-critical"
      + id            = (known after apply)
      + principal     = "sns.amazonaws.com"
      + source_arn    = "arn:aws:sns:us-east-1:239043911459:alert-critical-us-east-1"
      + statement_id  = (known after apply)
    }

  # aws_lambda_permission.sns_ok_us_east_1_to_slack_lambda will be created
  + resource "aws_lambda_permission" "sns_ok_us_east_1_to_slack_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-ok"
      + id            = (known after apply)
      + principal     = "sns.amazonaws.com"
      + source_arn    = "arn:aws:sns:us-east-1:239043911459:alert-ok-us-east-1"
      + statement_id  = (known after apply)
    }

  # aws_lambda_permission.sns_warning_us_east_1_to_slack_lambda will be created
  + resource "aws_lambda_permission" "sns_warning_us_east_1_to_slack_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-warning"
      + id            = (known after apply)
      + principal     = "sns.amazonaws.com"
      + source_arn    = "arn:aws:sns:us-east-1:239043911459:alert-warning-us-east-1"
      + statement_id  = (known after apply)
    }

  # aws_sns_topic_subscription.sns_alert_critical_us_east_1_to_lambda must be replaced
-/+ resource "aws_sns_topic_subscription" "sns_alert_critical_us_east_1_to_lambda" {
      ~ arn                             = "arn:aws:sns:us-east-1:239043911459:alert-critical-us-east-1:bd55bca4-1f6d-416b-8954-97f3d21ec2af" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      ~ endpoint                        = "arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-critical_us_east_1" -> "arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-critical" # forces replacement
      ~ id                              = "arn:aws:sns:us-east-1:239043911459:alert-critical-us-east-1:bd55bca4-1f6d-416b-8954-97f3d21ec2af" -> (known after apply)
      ~ owner_id                        = "239043911459" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.sns_alert_ok_us_east_1_to_lambda must be replaced
-/+ resource "aws_sns_topic_subscription" "sns_alert_ok_us_east_1_to_lambda" {
      ~ arn                             = "arn:aws:sns:us-east-1:239043911459:alert-ok-us-east-1:c76991f0-0784-496f-8490-a16d69175ca8" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      ~ endpoint                        = "arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-ok_us_east_1" -> "arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-ok" # forces replacement
      ~ id                              = "arn:aws:sns:us-east-1:239043911459:alert-ok-us-east-1:c76991f0-0784-496f-8490-a16d69175ca8" -> (known after apply)
      ~ owner_id                        = "239043911459" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.sns_alert_warning_us_east_1_to_lambda must be replaced
-/+ resource "aws_sns_topic_subscription" "sns_alert_warning_us_east_1_to_lambda" {
      ~ arn                             = "arn:aws:sns:us-east-1:239043911459:alert-warning-us-east-1:8c6e8a09-9744-44fc-bb44-4cf0a0e4aa80" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      ~ endpoint                        = "arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-warning_us_east_1" -> "arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-warning" # forces replacement
      ~ id                              = "arn:aws:sns:us-east-1:239043911459:alert-warning-us-east-1:8c6e8a09-9744-44fc-bb44-4cf0a0e4aa80" -> (known after apply)
      ~ owner_id                        = "239043911459" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.notify_slack_critical_us_east_1.aws_cloudwatch_log_group.lambda[0] will be destroyed
  # (because aws_cloudwatch_log_group.lambda is not in configuration)
  - resource "aws_cloudwatch_log_group" "lambda" {
      - arn               = "arn:aws:logs:ca-central-1:239043911459:log-group:/aws/lambda/notify-slack-critical_us_east_1" -> null
      - id                = "/aws/lambda/notify-slack-critical_us_east_1" -> null
      - name              = "/aws/lambda/notify-slack-critical_us_east_1" -> null
      - retention_in_days = 90 -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
    }

  # module.notify_slack_ok_us_east_1.aws_cloudwatch_log_group.lambda[0] will be destroyed
  # (because aws_cloudwatch_log_group.lambda is not in configuration)
  - resource "aws_cloudwatch_log_group" "lambda" {
      - arn               = "arn:aws:logs:ca-central-1:239043911459:log-group:/aws/lambda/notify-slack-ok_us_east_1" -> null
      - id                = "/aws/lambda/notify-slack-ok_us_east_1" -> null
      - name              = "/aws/lambda/notify-slack-ok_us_east_1" -> null
      - retention_in_days = 90 -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
    }

  # module.notify_slack_warning_us_east_1.aws_cloudwatch_log_group.lambda[0] will be destroyed
  # (because aws_cloudwatch_log_group.lambda is not in configuration)
  - resource "aws_cloudwatch_log_group" "lambda" {
      - arn               = "arn:aws:logs:ca-central-1:239043911459:log-group:/aws/lambda/notify-slack-warning_us_east_1" -> null
      - id                = "/aws/lambda/notify-slack-warning_us_east_1" -> null
      - name              = "/aws/lambda/notify-slack-warning_us_east_1" -> null
      - retention_in_days = 90 -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
    }

  # module.notify_slack_critical_us_east_1.module.lambda.aws_iam_policy.additional_json[0] will be destroyed
  # (because aws_iam_policy.additional_json is not in configuration)
  - resource "aws_iam_policy" "additional_json" {
      - arn       = "arn:aws:iam::239043911459:policy/lambda-notify-slack-critical_us_east_1" -> null
      - id        = "arn:aws:iam::239043911459:policy/lambda-notify-slack-critical_us_east_1" -> null
      - name      = "lambda-notify-slack-critical_us_east_1" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:239043911459:log-group:/aws/lambda/notify-slack-critical_us_east_1:*"
                      - Sid      = "AllowWriteToCloudwatchLogs"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPATPKBAT4RZV4VWAAVY" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
    }

  # module.notify_slack_critical_us_east_1.module.lambda.aws_iam_role.lambda[0] will be destroyed
  # (because aws_iam_role.lambda is not in configuration)
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::239043911459:role/lambda-notify-slack-critical_us_east_1" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-01-16T18:53:36Z" -> null
      - force_detach_policies = true -> null
      - id                    = "lambda-notify-slack-critical_us_east_1" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::239043911459:policy/lambda-notify-slack-critical_us_east_1",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "lambda-notify-slack-critical_us_east_1" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROATPKBAT4RY2K3HITAK" -> null

      - inline_policy {}
    }

  # module.notify_slack_critical_us_east_1.module.lambda.aws_iam_role_policy_attachment.additional_json[0] will be destroyed
  # (because aws_iam_role_policy_attachment.additional_json is not in configuration)
  - resource "aws_iam_role_policy_attachment" "additional_json" {
      - id         = "lambda-notify-slack-critical_us_east_1-20230116185337895700000002" -> null
      - policy_arn = "arn:aws:iam::239043911459:policy/lambda-notify-slack-critical_us_east_1" -> null
      - role       = "lambda-notify-slack-critical_us_east_1" -> null
    }

  # module.notify_slack_critical_us_east_1.module.lambda.aws_lambda_function.this[0] will be destroyed
  # (because aws_lambda_function.this is not in configuration)
  - resource "aws_lambda_function" "this" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-critical_us_east_1" -> null
      - code_signing_config_arn        = "" -> null
      - description                    = "" -> null
      - filename                       = "builds/9540d85f74c4113867007d3a68ed87855cccd09234105e7492327a0d7572b16c.zip" -> null
      - function_name                  = "notify-slack-critical_us_east_1" -> null
      - handler                        = "notify_slack.lambda_handler" -> null
      - id                             = "notify-slack-critical_us_east_1" -> null
      - image_uri                      = "" -> null
      - invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-critical_us_east_1/invocations" -> null
      - kms_key_arn                    = "" -> null
      - last_modified                  = "2023-01-16T18:53:59.848+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = true -> null
      - qualified_arn                  = "arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-critical_us_east_1:1" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::239043911459:role/lambda-notify-slack-critical_us_east_1" -> null
      - runtime                        = "python3.8" -> null
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
      - source_code_hash               = "py277xJxgEyU/1cHjJB977eT8Wi1wvOsR5zpWpC8fbA=" -> null
      - source_code_size               = 2989 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 30 -> null
      - version                        = "1" -> null

      - environment {
          - variables = {
              - "LOG_EVENTS"        = "False"
              - "SLACK_CHANNEL"     = "notification-staging-ops"
              - "SLACK_EMOJI"       = ":rotating_light:"
              - "SLACK_USERNAME"    = "[CRITICAL] AWS Cloudwatch"
              - "SLACK_WEBHOOK_URL" = (sensitive)
            } -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.notify_slack_critical_us_east_1.module.lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromSNS"] will be destroyed
  # (because aws_lambda_permission.current_version_triggers is not in configuration)
  - resource "aws_lambda_permission" "current_version_triggers" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "notify-slack-critical_us_east_1" -> null
      - id            = "AllowExecutionFromSNS" -> null
      - principal     = "sns.amazonaws.com" -> null
      - qualifier     = "1" -> null
      - source_arn    = "arn:aws:sns:ca-central-1:239043911459:alert-critical-us-east-1" -> null
      - statement_id  = "AllowExecutionFromSNS" -> null
    }

  # module.notify_slack_critical_us_east_1.module.lambda.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromSNS"] will be destroyed
  # (because aws_lambda_permission.unqualified_alias_triggers is not in configuration)
  - resource "aws_lambda_permission" "unqualified_alias_triggers" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "notify-slack-critical_us_east_1" -> null
      - id            = "AllowExecutionFromSNS" -> null
      - principal     = "sns.amazonaws.com" -> null
      - source_arn    = "arn:aws:sns:ca-central-1:239043911459:alert-critical-us-east-1" -> null
      - statement_id  = "AllowExecutionFromSNS" -> null
    }

  # module.notify_slack_critical_us_east_1.module.lambda.null_resource.archive[0] will be destroyed
  # (because null_resource.archive is not in configuration)
  - resource "null_resource" "archive" {
      - id       = "3610791953059087670" -> null
      - triggers = {
          - "filename"  = "builds/9540d85f74c4113867007d3a68ed87855cccd09234105e7492327a0d7572b16c.zip"
          - "timestamp" = "<WARNING: Missing lambda zip artifacts wouldn't be restored>"
        } -> null
    }

  # module.notify_slack_ok_us_east_1.module.lambda.aws_iam_policy.additional_json[0] will be destroyed
  # (because aws_iam_policy.additional_json is not in configuration)
  - resource "aws_iam_policy" "additional_json" {
      - arn       = "arn:aws:iam::239043911459:policy/lambda-notify-slack-ok_us_east_1" -> null
      - id        = "arn:aws:iam::239043911459:policy/lambda-notify-slack-ok_us_east_1" -> null
      - name      = "lambda-notify-slack-ok_us_east_1" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:239043911459:log-group:/aws/lambda/notify-slack-ok_us_east_1:*"
                      - Sid      = "AllowWriteToCloudwatchLogs"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPATPKBAT4RXB4C7N7UT" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
    }

  # module.notify_slack_ok_us_east_1.module.lambda.aws_iam_role.lambda[0] will be destroyed
  # (because aws_iam_role.lambda is not in configuration)
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::239043911459:role/lambda-notify-slack-ok_us_east_1" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-01-16T18:53:36Z" -> null
      - force_detach_policies = true -> null
      - id                    = "lambda-notify-slack-ok_us_east_1" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::239043911459:policy/lambda-notify-slack-ok_us_east_1",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "lambda-notify-slack-ok_us_east_1" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROATPKBAT4RYRZHOIRBO" -> null

      - inline_policy {}
    }

  # module.notify_slack_ok_us_east_1.module.lambda.aws_iam_role_policy_attachment.additional_json[0] will be destroyed
  # (because aws_iam_role_policy_attachment.additional_json is not in configuration)
  - resource "aws_iam_role_policy_attachment" "additional_json" {
      - id         = "lambda-notify-slack-ok_us_east_1-20230116185337988200000003" -> null
      - policy_arn = "arn:aws:iam::239043911459:policy/lambda-notify-slack-ok_us_east_1" -> null
      - role       = "lambda-notify-slack-ok_us_east_1" -> null
    }

  # module.notify_slack_ok_us_east_1.module.lambda.aws_lambda_function.this[0] will be destroyed
  # (because aws_lambda_function.this is not in configuration)
  - resource "aws_lambda_function" "this" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-ok_us_east_1" -> null
      - code_signing_config_arn        = "" -> null
      - description                    = "" -> null
      - filename                       = "builds/f6e8800f6dab7a4c6d263ade99eb7d36027d8726cd7a5c49e0f7f812485eda7d.zip" -> null
      - function_name                  = "notify-slack-ok_us_east_1" -> null
      - handler                        = "notify_slack.lambda_handler" -> null
      - id                             = "notify-slack-ok_us_east_1" -> null
      - image_uri                      = "" -> null
      - invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-ok_us_east_1/invocations" -> null
      - kms_key_arn                    = "" -> null
      - last_modified                  = "2023-01-16T18:54:06.316+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = true -> null
      - qualified_arn                  = "arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-ok_us_east_1:1" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::239043911459:role/lambda-notify-slack-ok_us_east_1" -> null
      - runtime                        = "python3.8" -> null
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
      - source_code_hash               = "py277xJxgEyU/1cHjJB977eT8Wi1wvOsR5zpWpC8fbA=" -> null
      - source_code_size               = 2989 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 30 -> null
      - version                        = "1" -> null

      - environment {
          - variables = {
              - "LOG_EVENTS"        = "False"
              - "SLACK_CHANNEL"     = "notification-staging-ops"
              - "SLACK_EMOJI"       = ":green:"
              - "SLACK_USERNAME"    = "[OK] AWS Cloudwatch"
              - "SLACK_WEBHOOK_URL" = (sensitive)
            } -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.notify_slack_ok_us_east_1.module.lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromSNS"] will be destroyed
  # (because aws_lambda_permission.current_version_triggers is not in configuration)
  - resource "aws_lambda_permission" "current_version_triggers" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "notify-slack-ok_us_east_1" -> null
      - id            = "AllowExecutionFromSNS" -> null
      - principal     = "sns.amazonaws.com" -> null
      - qualifier     = "1" -> null
      - source_arn    = "arn:aws:sns:ca-central-1:239043911459:alert-ok-us-east-1" -> null
      - statement_id  = "AllowExecutionFromSNS" -> null
    }

  # module.notify_slack_ok_us_east_1.module.lambda.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromSNS"] will be destroyed
  # (because aws_lambda_permission.unqualified_alias_triggers is not in configuration)
  - resource "aws_lambda_permission" "unqualified_alias_triggers" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "notify-slack-ok_us_east_1" -> null
      - id            = "AllowExecutionFromSNS" -> null
      - principal     = "sns.amazonaws.com" -> null
      - source_arn    = "arn:aws:sns:ca-central-1:239043911459:alert-ok-us-east-1" -> null
      - statement_id  = "AllowExecutionFromSNS" -> null
    }

  # module.notify_slack_ok_us_east_1.module.lambda.null_resource.archive[0] will be destroyed
  # (because null_resource.archive is not in configuration)
  - resource "null_resource" "archive" {
      - id       = "690663[403](https://github.com/cds-snc/notification-terraform/actions/runs/3933684912/jobs/6727654258#step:6:404)6181538004" -> null
      - triggers = {
          - "filename"  = "builds/f6e8800f6dab7a4c6d263ade99eb7d36027d8726cd7a5c49e0f7f812485eda7d.zip"
          - "timestamp" = "<WARNING: Missing lambda zip artifacts wouldn't be restored>"
        } -> null
    }

  # module.notify_slack_warning_us_east_1.module.lambda.aws_iam_policy.additional_json[0] will be destroyed
  # (because aws_iam_policy.additional_json is not in configuration)
  - resource "aws_iam_policy" "additional_json" {
      - arn       = "arn:aws:iam::239043911459:policy/lambda-notify-slack-warning_us_east_1" -> null
      - id        = "arn:aws:iam::239043911459:policy/lambda-notify-slack-warning_us_east_1" -> null
      - name      = "lambda-notify-slack-warning_us_east_1" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:239043911459:log-group:/aws/lambda/notify-slack-warning_us_east_1:*"
                      - Sid      = "AllowWriteToCloudwatchLogs"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPATPKBAT4RRC5S4P5I6" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
    }

  # module.notify_slack_warning_us_east_1.module.lambda.aws_iam_role.lambda[0] will be destroyed
  # (because aws_iam_role.lambda is not in configuration)
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::239043911459:role/lambda-notify-slack-warning_us_east_1" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-01-16T18:53:36Z" -> null
      - force_detach_policies = true -> null
      - id                    = "lambda-notify-slack-warning_us_east_1" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::239043911459:policy/lambda-notify-slack-warning_us_east_1",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "lambda-notify-slack-warning_us_east_1" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROATPKBAT4RRH3RT3RRJ" -> null

      - inline_policy {}
    }

  # module.notify_slack_warning_us_east_1.module.lambda.aws_iam_role_policy_attachment.additional_json[0] will be destroyed
  # (because aws_iam_role_policy_attachment.additional_json is not in configuration)
  - resource "aws_iam_role_policy_attachment" "additional_json" {
      - id         = "lambda-notify-slack-warning_us_east_1-20230116185337827200000001" -> null
      - policy_arn = "arn:aws:iam::2390[439](https://github.com/cds-snc/notification-terraform/actions/runs/3933684912/jobs/6727654258#step:6:440)11459:policy/lambda-notify-slack-warning_us_east_1" -> null
      - role       = "lambda-notify-slack-warning_us_east_1" -> null
    }

  # module.notify_slack_warning_us_east_1.module.lambda.aws_lambda_function.this[0] will be destroyed
  # (because aws_lambda_function.this is not in configuration)
  - resource "aws_lambda_function" "this" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-warning_us_east_1" -> null
      - code_signing_config_arn        = "" -> null
      - description                    = "" -> null
      - filename                       = "builds/360cdc7ecfe3d77e32ea1a5ba2459ed54a566fa47c4f658c0eddfa3365c79c47.zip" -> null
      - function_name                  = "notify-slack-warning_us_east_1" -> null
      - handler                        = "notify_slack.lambda_handler" -> null
      - id                             = "notify-slack-warning_us_east_1" -> null
      - image_uri                      = "" -> null
      - invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-warning_us_east_1/invocations" -> null
      - kms_key_arn                    = "" -> null
      - last_modified                  = "2023-01-16T18:53:53.325+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = true -> null
      - qualified_arn                  = "arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-warning_us_east_1:1" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::239043911459:role/lambda-notify-slack-warning_us_east_1" -> null
      - runtime                        = "python3.8" -> null
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
      - source_code_hash               = "py277xJxgEyU/1cHjJB977eT8Wi1wvOsR5zpWpC8fbA=" -> null
      - source_code_size               = 2989 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 30 -> null
      - version                        = "1" -> null

      - environment {
          - variables = {
              - "LOG_EVENTS"        = "False"
              - "SLACK_CHANNEL"     = "notification-staging-ops"
              - "SLACK_EMOJI"       = ":warning:"
Warning:      - "SLACK_USERNAME"    = "[WARNING] AWS Cloudwatch"
              - "SLACK_WEBHOOK_URL" = (sensitive)
            } -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.notify_slack_warning_us_east_1.module.lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromSNS"] will be destroyed
  # (because aws_lambda_permission.current_version_triggers is not in configuration)
  - resource "aws_lambda_permission" "current_version_triggers" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "notify-slack-warning_us_east_1" -> null
      - id            = "AllowExecutionFromSNS" -> null
      - principal     = "sns.amazonaws.com" -> null
      - qualifier     = "1" -> null
      - source_arn    = "arn:aws:sns:ca-central-1:239043911459:alert-warning-us-east-1" -> null
      - statement_id  = "AllowExecutionFromSNS" -> null
    }

  # module.notify_slack_warning_us_east_1.module.lambda.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromSNS"] will be destroyed
  # (because aws_lambda_permission.unqualified_alias_triggers is not in configuration)
  - resource "aws_lambda_permission" "unqualified_alias_triggers" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "notify-slack-warning_us_east_1" -> null
      - id            = "AllowExecutionFromSNS" -> null
      - principal     = "sns.amazonaws.com" -> null
      - source_arn    = "arn:aws:sns:ca-central-1:239043911459:alert-warning-us-east-1" -> null
      - statement_id  = "AllowExecutionFromSNS" -> null
    }

  # module.notify_slack_warning_us_east_1.module.lambda.null_resource.archive[0] will be destroyed
  # (because null_resource.archive is not in configuration)
  - resource "null_resource" "archive" {
      - id       = "636697581[451](https://github.com/cds-snc/notification-terraform/actions/runs/3933684912/jobs/6727654258#step:6:452)7807583" -> null
      - triggers = {
          - "filename"  = "builds/360cdc7ecfe3d77e32ea1a5ba2459ed54a566fa47c4f658c0eddfa3365c79c47.zip"
          - "timestamp" = "<WARNING: Missing lambda zip artifacts wouldn't be restored>"
        } -> null
    }

Plan: 6 to add, 0 to change, 27 to destroy.

```